# ДЗ*:
# 1. Написать функцию binary_search, принимающую в качестве входящего параметра
# элемент для поиска и список в котором необходимо искать.
# 2. Алгоритм должен искать с помощью двоичного поиска, изображенного на блок-схеме
# презентации.
# 3. Функция в итоге должна распечатать результат.
# 4. Написать функцию buble_sort или selection_sort, принимающую в качестве входящего
# параметра не отсортированный список.
# 5. Алгоритм функции должен сортировать список методом пузырьковой сортировки или
# методом сортировки выбором.
# 6. Функция в итоге должна возвращать отсортированный список.

from hw_5 import Casino

c = Casino()
